Revit 2027 API
IndependentTag.TagHeadPosition Property
 The position of the head of tag in model coordinates.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ TagHeadPosition { get; set; }
Public Property TagHeadPosition As XYZ
	Get
	Set
public:
property XYZ^ TagHeadPosition {
	XYZ^ get ();
	void set (XYZ^ value);
}
member TagHeadPosition : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 The depth of the tag head position in the view does not matter because tags are drawn over model geometry in the view.
See Also
Reference
IndependentTag Class
Autodesk.Revit.DB Namespace